[{
  "_id": {
    "$oid": "65204f49201f13bbe04051ef"
  },
  "page_title": "Frank Lobe - Experience",
  "experience_content": [
    {
      "experience_description": "Enhanced Non-delegated Correspondent Lending Channel",
      "url": "https://www.rocketprotpo.com/partner-with-us-assisted-corr/",
      "experience_paragraphs": [
        "The Enhanced Non-delegated Correspondent Lending Channel is a groundbreaking new product introduced by Rocket Pro TPO. It represents a complete transformation, developed from scratch, to bridge the gap between wholesale lending and traditional non-delegated correspondent lending.",
        "The project commenced with a comprehensive analysis to identify existing functionalities that could be leveraged and areas that required new or modified features. A high-level architectural design was then formulated. The development phase encompassed changing the legacy system, known as AMP, to accommodate all mortgage and application package types and adhere to state-specific legislation. Machine learning models were developed to create a tailored mortgage application experience for the mortgage applicant by predicting values such as scheduled closing date and applicant specific disclosure provisions and clauses. Seamless integration with middleware and the web front end was successfully achieved using REST APIs."
      ]
    },
    {
      "experience_description": "Bank of America Merrill Lynch Foreign Exchange",
      "url": "",
      "experience_paragraphs": [
        "This pioneering product aimed to significantly reduce the foreign exchange spread on transactions by optimizing the timing of money movement. By bringing the movement of funds closer to the point of transaction finalization, the potential cost savings could reach millions of dollars, even for a single transaction.",
        "This functionality was developed for IFDS, specifically for their legacy system, iFast. Transactions requiring foreign exchange were exported to an output file and subsequently imported into Bank of America's Instinct system. This approach enabled currency exchange at a transaction level, eliminating the reliance on a fixed exchange rate with a higher spread. The resulting exchange rates were seamlessly imported back into iFast, completing the process.",
        "Through this innovative solution, we aimed to optimize the efficiency of foreign exchange transactions and unlock significant cost savings for IFDS. By integrating iFast with Bank of America's Instinct system, we ensured precise currency exchange rates based on transaction-specific market rates, eliminating the need for less favorable fixed rates."
      ]
    },
    {
      "experience_description": "ECHO Cash Prediction",
      "url": "",
      "experience_paragraphs": [
        "ECHO was a groundbreaking product designed to consolidate seven separate data feeds into a unified stream of information. This consolidated data feed served as a valuable resource for a new web application, accessible through a REST API. The primary objective was to equip traders with invaluable insights into their anticipated cash position for the following day. Machine learning was used to predict values in instances where conventional methods could not be utilized.",
        "Working on behalf of IFDS, we undertook this project for State Street, leveraging a legacy system. By harnessing the power of this system, we successfully developed ECHO, a robust solution that met and exceeded the project's requirements.",
        "ECHO was launched to hundreds of State Street's esteemed clients following a meticulous development process. Its successful implementation has empowered traders with enhanced visibility and predictive capabilities regarding their cash position, enabling them to make informed decisions confidently.",
        "The completion of this product stands as a testament to our commitment to delivering innovative solutions that drive value for our clients. We are proud to have played a pivotal role in the development and launch of ECHO, which has garnered positive feedback and adoption from State Street's extensive client base."
      ]
    },
    {
      "experience_description": "Sun Life APIs",
      "url": "",
      "experience_paragraphs": [
        "On behalf of IFDS, I spearheaded the development of seven cutting-edge APIs for Sun Life. This transformational initiative took place within the framework of iFast, a legacy system. The primary focus was to augment the capabilities of the existing web front end by introducing these powerful APIs.",
        "The development process entailed meticulous planning and execution to ensure seamless integration of the new APIs with the iFast system. Leveraging my expertise and deep understanding of the legacy infrastructure, I successfully designed and implemented these APIs, unlocking a host of advanced functionalities.",
        "The impact of these APIs on the web front end was truly remarkable. They brought about a significant enhancement, empowering users with broader capabilities, increased efficiency, and improved user experience. Sun Life's clients and stakeholders have leveraged these enriched features to make more informed decisions and streamline operations.",
        "The successful development and deployment of these seven APIs represent a noteworthy accomplishment. I am proud to have played a pivotal role in this project, contributing to the growth and success of Sun Life's technology ecosystem."
      ]
    },
    {
      "experience_description": "Fundserv Help File Implementation",
      "url": "",
      "experience_paragraphs": [
        "I spearheaded multiple Fundserv implementations for various clients, assuming the lead role in four of them. I successfully led a team of six to seven developers, ensuring seamless execution.",
        "My involvement spanned all existing Fundserv files, focusing on the order, settlement instruction, and transaction reconciliation files. These critical components required meticulous attention and expertise, as they formed the backbone of the Fundserv integration.",
        "Operating within the confines of three legacy systems, specifically at Dynamic, MacKenzie Financial, and B2B Bank, I effectively leveraged my technical prowess and in-depth understanding of the systems. This allowed for smoothly incorporating Fundserv functionalities, enabling efficient order processing, accurate settlement instructions, and seamless transaction reconciliation.",
        "I take great pride in my contributions to these projects, navigating complex legacy systems and ensuring the successful adoption of Fundserv at Dynamic, MacKenzie Financial, and B2B Bank. My role as a lead developer has allowed me to make a meaningful impact, collaborating with a talented team to achieve exceptional results."
      ]
    },
    {
      "experience_description": "Norkom Anti-money Laundering Implementation",
      "url": "",
      "experience_paragraphs": [
        "I had the privilege of leading a transformative project for the Bank of Montreal, which seamlessly integrates Norkom's state-of-the-art anti-money laundering solution into their existing systems. This encompassed personal and commercial banking, capital markets, and Mastercard transaction flows.",
        "The Norkom anti-money laundering solution was pivotal in scrutinizing transactions for potential money laundering activities. Its advanced algorithms meticulously scanned for suspicious patterns and behaviors, explicitly targeting activities associated with international terrorist and criminal organizations. Upon detection, the identified profiles were promptly forwarded to various international law enforcement and intelligence agencies for further investigation.",
        "As a senior technical specialist, I shouldered overseeing the vendor relationship with Norkom. I managed nine distinct development, quality assurance, and user acceptance testing environments. Furthermore, I spearheaded the implementation of upgrades across multiple data centers located throughout Canada."
      ]
    },
    {
      "experience_description": "Investor's Group Migration",
      "url": "",
      "experience_paragraphs": [
        "Investor's Group underwent a significant transfer of their custodial function from National Bank to MacKenzie Financial. The initial phase of this transition involved the development of a new billing platform, as Investor's Group operated on a distinct billing model. These crucial modifications were implemented within the framework of CPS, a legacy application.",
        "On June 10, 2005, a momentous milestone was achieved as all assets belonging to Investor's Group were successfully transferred from National Bank to MRS. This transfer encompassed a substantial value of approximately 4.8 billion dollars in cash and assets. As the sole individual responsible for executing this complex movement, I meticulously orchestrated the seamless transfer of these positions.",
        "This achievement highlights my unwavering commitment and expertise in handling complex financial operations. Through meticulous planning, diligent execution, and careful attention to detail, I ensured the smooth transition of assets from National Bank to MRS on behalf of Investor's Group. This accomplishment underscores my ability to navigate high-value transactions with precision and confidence."
      ]
    },
    {
      "experience_description": "Investment Portfolio Modelling",
      "url": "",
      "experience_paragraphs": [
        "Investment Portfolio Modelling (IPM) marked a groundbreaking addition to UBS's product lineup, developed in collaboration with IFDS. This innovative solution was built upon the robust system, iFast. The primary objective of IPM was to ensure that account holders' portfolios adhered to a specific asset allocation strategy crafted by professional portfolio managers.",
        "Investors had the opportunity to subscribe to a particular model that aligned with their investment objectives. If their portfolio deviated from the desired asset allocation by a predetermined percentage, IPM generated adjusting transactions to realign the portfolio with the target allocation.",
        "This project was particularly significant, marking my first experience as a project lead. Taking on this role, I embraced overseeing the project's successful execution from inception to completion.",
        "Through meticulous planning, effective collaboration with stakeholders, and comprehensive management of the development process, IPM was brought to life."
      ]
    },
    {
      "experience_description": "Broker Interface System",
      "url": "",
      "experience_paragraphs": [
        "The broker interface system aimed to introduce the Canadian Fundserv information exchange model to the European market. This ambitious project revolved around defining and implementing file data standards within the iFast system.",
        "The key focus of this endeavor was to facilitate seamless data transfer between financial institutions, automating essential functions such as account reconciliation, order placement, transaction settlement, and accountholder information changes. By establishing standardized file data definitions, we ensured compatibility and interoperability across various participants in the financial ecosystem.",
        "We successfully manifested these data standards within the iFast system through meticulous planning and collaboration. This integration streamlined and automated critical processes, reducing manual effort, minimizing errors, and optimizing operational efficiency for all stakeholders involved.",
        "Implementing the broker interface system fostered enhanced collaboration and information exchange between financial institutions."
      ]
    },
    {
      "experience_description": "Introduction of the Euro Currency",
      "url": "",
      "experience_paragraphs": [
        "I undertook a critical responsibility of developing processes to convert all currency-dependent data elements of accountholders from their previous sovereign currencies to euro. This intricate task encompassed implementing new user interface elements and designing robust business logical processes. The entire conversion was executed seamlessly across the system-wide infrastructure of iFast.",
        "To accomplish this goal, I meticulously analyzed and mapped all currency-dependent data elements, ensuring comprehensive coverage across the system. By integrating new user interface elements, we provided a seamless and intuitive experience for users to interact with the converted euro currency. Simultaneously, I developed and implemented logical business processes to handle currency conversion efficiently and accurately.",
        "The conversion from sovereign currencies to euro presented a unique challenge, requiring a deep understanding of currency exchange rates and intricate financial calculations. With expertise in technical and financial domains, I navigated this complexity, ensuring precision in the conversion process and maintaining data integrity."
      ]
    },
    {
      "experience_description": "Transaction Cancellation and Correction",
      "url": "",
      "experience_paragraphs": [
        "This project was initiated to leverage trading gains that arise from trade reversals or corrections. This valuable functionality was developed within the framework of CPS.",
        "The primary objective was to capitalize on opportunities when trade reversals or corrections led to financial gains. By implementing this functionality, we created a streamlined process within CPS to identify and capture these gains, maximizing the overall trading performance.",
        "Through meticulous design and development, we integrated the necessary mechanisms within CPS to detect trade reversals or corrections that resulted in favorable outcomes. This involved comprehensive data analysis, algorithmic calculations, and effective risk management strategies to seize these trading gains.",
        "The successful implementation of this functionality within CPS unlocked the potential for increased profitability and improved trading outcomes. By capitalizing on trade reversals or corrections that generated gains, we enhanced the overall performance of the trading operations, maximizing returns for the organization."
      ]
    },
    {
      "experience_description": "Cheque Reconciliation",
      "url": "",
      "experience_paragraphs": [
        "The cheque reconciliation system revolutionized manually reconciling cheques by introducing a new, automated system. This innovative solution involved the implementation of a data file reader, which received files from the client directly. The received information was then meticulously compared to the existing cheque records within the CPS system.",
        "By replacing the manual reconciliation process, we significantly improved efficiency and accuracy. The new system seamlessly extracted and parsed the data file, seamlessly comparing the existing cheque records. This automated approach reduced the risk of human errors and expedited the reconciliation process, saving valuable time and resources for the organization.",
        "We ensured that the data file reader integrated seamlessly with the CPS system through meticulous design and development, leveraging its capabilities to perform comprehensive and accurate cheque reconciliations. The enhanced system allowed for swift identification of discrepancies and discrepancies between the received data and existing cheque records, enabling prompt resolution and maintaining accurate financial records."
      ]
    },
    {
      "experience_description": "Pre-authorized Credit Maintenance",
      "url": "",
      "experience_paragraphs": [
        "I undertook the significant task of completely rewriting the pre-authorized credit maintenance screens within the CPS system. This ambitious project involved a comprehensive overhaul to enhance the user experience and optimize the underlying structure.",
        "To achieve these objectives, I leveraged advanced user interface components and adopted a more modern and efficient object-oriented, event-driven architecture. Through meticulous planning and development, I transformed the existing screens into a sleek, intuitive interface that maximized user usability and productivity.",
        "By utilizing user interface components, I introduced a visually appealing and interactive design, improving the overall aesthetic and usability of the pre-authorized credit maintenance screens. This modernization significantly enhanced the user experience, empowering users to navigate and interact with the system more effectively.",
        "In addition to the visual improvements, adopting an object-oriented, event-driven structure brought numerous benefits. This approach improved code organization, modularity, and easier system maintenance."
      ]
    },
    {
      "experience_description": "General Ledger Reconciliation",
      "url": "",
      "experience_paragraphs": [
        "I developed a comprehensive report within the CPS system, to enable users to reconcile general ledger accounts efficiently. This report served as a valuable tool in ensuring accurate financial records and facilitating the reconciliation process.",
        "I designed the report with meticulous attention to detail to provide users with clear and concise information regarding their general ledger accounts. I created a robust and intuitive report that presented relevant data in a user-friendly format.",
        "The reconciliation report empowered users to compare and verify the transactions recorded in their general ledger accounts. The report facilitated a streamlined reconciliation process by presenting essential information such as account balances, transaction details, and related data. Users could quickly identify discrepancies or inconsistencies, enabling them to take prompt corrective action.",
        "By utilizing the capabilities of the CPS system, I ensured seamless integration and efficient generation of the reconciliation report."
      ]
    },
    {
      "experience_description": "Market Value Reporting System",
      "url": "",
      "experience_paragraphs": [
        "I undertook the extensive task of completely rewriting the market value reporting system within CPS. This ambitious project aimed to enhance the reporting system's accuracy, efficiency, and functionality.",
        "Through meticulous planning and development, I revamped the market value reporting system from the ground up. This rewrite involved redesigning the underlying architecture, optimizing data processing algorithms, and implementing a more intuitive user interface.",
        "By adopting modern coding practices and adhering to industry best practices, I ensured that the rewritten market value reporting system was more robust, scalable, and maintainable. The revamped architecture facilitated streamlined data retrieval, processing, and presentation, resulting in faster and more accurate reporting. Furthermore, I focused on enhancing the user experience by introducing a more intuitive and user-friendly interface."
      ]
    },
    {
      "experience_description": "IRS Compliance Reporting",
      "url": "",
      "experience_paragraphs": [
        "I undertook a complete overhaul of the IRS compliance reporting system, revamping it from the ground up. This transformational initiative was executed on the CPS system.",
        "During the rewriting process, I applied my database application development and analysis expertise to enhance the system's functionality and performance. The new system incorporated modern user interface components, leveraging the capabilities of user interface technologies. I also implemented an object-oriented, event-driven structure to improve the system's efficiency and maintainability.",
        "By reimagining the IRS compliance reporting system, I ensured it adhered to the latest regulatory requirements and industry best practices. The rewritten system met the specific needs of IRS compliance and provided a seamless user experience for generating accurate and timely reports.",
        "I successfully delivered a robust and efficient IRS compliance reporting system through meticulous planning, rigorous coding, and thorough testing."
      ]
    },
    {
      "experience_description": "CCRA-registered Account Reporting",
      "url": "",
      "experience_paragraphs": [
        "I embarked on a comprehensive revamp of the CCRA registered account reporting system, undertaking a complete rewrite to elevate its capabilities and performance. This transformational initiative was carried out on the CPS system.",
        "Throughout the rewriting process, I harnessed my expertise in database application development and analysis to enhance the system's functionalities and optimize efficiency. By leveraging the power of advanced user interface components, I revamped the user interface to deliver a seamless and intuitive experience for generating CCRA-registered account reports.",
        "Employing an object-oriented, event-driven structure, I meticulously designed and implemented the new system, ensuring its adherence to the latest CCRA regulations and industry standards. The rewritten system not only improved the accuracy and reliability of the reports but also significantly enhanced the overall performance and maintainability.",
        "I successfully delivered a robust CCRA-registered account reporting system through meticulous planning, rigorous coding, and comprehensive testing."
      ]
    },
    {
      "experience_description": "Dealer Agreement Tracking",
      "url": "",
      "experience_paragraphs": [
        "I spearheaded the development of a cutting-edge system designed to streamline the tracking of dealer agreements. I crafted a robust solution that revolutionized how dealer agreements were managed.",
        "Through meticulous planning and meticulous attention to detail, I engineered a user-friendly interface that simplified the process of inputting, updating, and retrieving dealer agreement data. I ensured seamless integration and optimal performance of the tracking system.",
        "This innovative solution provided organizations a centralized platform to monitor and manage their dealer agreements effectively. It enabled real-time tracking of key information, such as contract terms, compliance requirements, and performance metrics, fostering transparency and accountability in dealer relationships.",
        "Furthermore, I implemented advanced reporting functionalities within the system, allowing users to generate insightful reports and analytics on dealer agreement performance. This empowered organizations to make data-driven decisions, optimize their dealer networks, and drive business growth."
      ]
    },
    {
      "experience_description": "Defined Contribution Pension System",
      "url": "",
      "experience_paragraphs": [
        "I led the development of an advanced defined contribution pension system. This transformative project aimed to revolutionize how pension contributions were managed and administered.",
        "With a deep understanding of pension regulations and industry best practices, I meticulously designed and implemented a comprehensive system that catered to defined contribution pension plans. The system incorporated robust features and functionalities to automate and streamline various aspects of pension management.",
        "Through CPS, I developed an intuitive user interface that allowed administrators to effortlessly input and track pension contributions, monitor investment performance, and generate accurate reports. The system seamlessly integrated with external financial institutions and custodians, ensuring smooth data exchange and accurate reconciliation of pension transactions.",
        "I also implemented sophisticated calculation engines within the system to handle complex pension calculations, such as employer matching contributions, vesting schedules, and investment returns. This ensured the accurate and timely processing of pension-related transactions and benefits."
      ]
    },
    {
      "experience_description": "Credit Card Default Analysis",
      "url": "https://www.kaggle.com/code/franklobe/credit-card-default-analysis",
      "experience_paragraphs": [
        "This Kaggle notebook consists of a comprehensive demonstration of utilizing classification machine learning algorithms from the scikit-learn library to accurately predict the probability of credit card default. The prediction is based on an array of informative features, including credit limit, age, billing amounts, payment amounts, gender, education, and relationship status. Exploring this notebook will allow valuable insights into the implementation and effectiveness of these algorithms for credit risk."
      ]
    },
    {
      "experience_description": "Electricity Usage Clustering",
      "url": "https://www.kaggle.com/code/franklobe/electricity-usage-clustering",
      "experience_paragraphs": [
        "This Kaggle notebook explores the application of clustering techniques to segment clients into distinct groups based on their usage patterns. The goal is to identify low, medium, and high-usage clusters, enabling the identification of high-profit clients and gaining deeper insights into their usage behavior.",
        "The dataset utilized in this analysis comprises three primary data elements: Client, Time, and Usage. Client and Time serve as dimensions, while Usage represents a fact table. This arrangement allows for a comprehensive examination of data both horizontally across clients and vertically across time.",
        "The time segments are explored using various time aggregations, including 15-minute intervals, hourly periods, weekdays, and months to provide a comprehensive analysis. Moreover, a year-over-year comparison is presented to identify significant changes or trends."
      ]
    },
    {
      "experience_description": "Financial Time Series",
      "url": "https://www.kaggle.com/code/franklobe/financial-time-series",
      "experience_paragraphs": [
        "This Kaggle notebook delves into time series analysis by exploring the price histories of prominent companies such as Facebook, Amazon, IBM, and 3M. The notebook focuses on several crucial aspects, including the correlation of returns, trend analysis, seasonality exploration, stationarity assessment, and autocorrelation investigation."
      ]
    }
  ]
}]